app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("created_at", "name", "type", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 14 Dec 2013 17:26:23 UTC +00:00], ["name", "om 3abdo"], ["type", "Liability"], ["updated_at", Sat, 14 Dec 2013 17:26:23 UTC +00:00]]
---
  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save