app/controllers/transactions_controller.rb

  def index
    authorize! :read, Transaction
    @transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"

  def new
    authorize! :create, Transaction
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def create
    @transaction = Transaction.build({
    :attachment => params[:transaction][:attachment],
    :description => params[:transaction][:description],
    :attachment => params[:transaction][:attachment],
    :credit => {:account=>params[:transaction][:credit_account],:amount => params[:transaction][:amount]},
    :debit => {:account=>params[:transaction][:debit_account],:amount => params[:transaction][:amount]}
    })

    #@transaction.save
    respond_to do |format|
      if @transaction.save
        format.html { redirect_to transactions_path, notice: 'Transaction was successfully created.' }
      else
        @accounts = Account.all
        flash[:error] = @transaction.errors.full_messages.join(",")
---
INSERT INTO "transactions" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 17 Dec 2013 08:58:49 UTC +00:00], ["description", nil], ["updated_at", Tue, 17 Dec 2013 08:58:49 UTC +00:00]]
SELECT "transactions".* FROM "transactions"