app/views/transactions/_form.html.erb

    <%= f.label :credit_accounts, 'Credit Account' %>
    <%= f.select :credit_accounts, options_from_collection_for_select(@accounts, 'name', 'name') %>
---
SELECT "accounts".* FROM "accounts"